MakeMyTrip/src/test/resources/profiles/TpDocMockreq_mcc_2.txt

    <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
      <soap:Header>
        <wsse:Security soap:mustUnderstand="1"
          xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
          <wsse:UsernameToken wsu:Id="UsernameToken-6">
            <wsse:Username>xleapweblogic</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">xleapweblogic123</wsse:Password>
          </wsse:UsernameToken>
        </wsse:Security>
      </soap:Header>
      <soap:Body>
        <GCSSMessage xmlns="http://services.apmoller.net/AMM/GCSSAdapter/v1"
          xmlns:ns2="http://services.apmoller.net/ManagementFramework/ServiceException/v2" xmlns:ns3="http://services.apmoller.net/ManagementFramework/CommonIdentifier/v2">
          <TAG0000>
            <Date_sent>20150522</Date_sent>
            <Time_sent>1718</Time_sent>
            <Sender>MYMAERSK</Sender>
            <Receiver>GCSS</Receiver>
            <Message_Reference/>
            <Application_Reference>shipment-binder-component</Application_Reference>
            <GCSS_Reference/>
            <Kind>Q</Kind>
            <Date_received/>
            <Time_Received/>
            <Reply_requested>Y</Reply_requested>
            <Message_Type_Code/>
            <Test_Flag/>
            <EDI_Receiver/>
            <EDI_AppRefNum/>
            <Version>34.0</Version>
            <Sent_By_Username/>
            <Sent_By_Name/>
            <Sent_By_Email/>
            <RaiseNotification/>
            <Sent_By_U-Adm_Team_Id/>
            <TAGQ100>
              <Size_of_reply_buffer/>
              <Max_number_of_bytes_in_result_set/>
              <Priority/>
              <Reply_Type>S</Reply_Type>
              <Include_Related_Shipments/>
              <Include_Transport_Document_on_Import_Shipment/>
            </TAGQ100>
            <TAGQ200>
              <Shipment_Status/>
              <Operator>3</Operator>
              <Not_Operator/>
              <Business_Unit/>
              <TAGQ232>
                <Reference_Type>5</Reference_Type>
                <Property_Type/>
                <Reference_Value>911318503</Reference_Value>
                <Property_Value/>
              </TAGQ232>
            </TAGQ200>
            <TAGQ300>
              <Tag_ids>TAG0100,TAG0110,TAG0120,TAG0150,TAG0160,TAG0170,TAG01A0,TAG01C0,TAG01C2,TAG01C3,TAG01C4,TAG01D0,TAG01D1,TAG01D2,TAG01G0,TAG01G1,TAG01L0,TAG0200,TAG0220,TAG0230,TAG0300,TAG0360,TAG0370,TAG03A0,TAG0400,TAG0410,TAG0411,TAG0450,TAG0453,TAG04E0,TAG0500,TAG0510,TAG0600,TAG0610,TAG0620,TAG0621,TAG0630,TAG0640,TAG0690,TAG0900,TAG0910,TAG0911,TAG01G0,TAG01G1,TAG0A00,TAG0A10,TAG0A20,TAG0A30,TAG0D00</Tag_ids>
            </TAGQ300>
          </TAG0000>
          <TAG0000>
            <Date_sent>20150522</Date_sent>
            <Time_sent>1718</Time_sent>
            <Sender>MYMAERSK</Sender>
            <Receiver>GCSS</Receiver>
            <Message_Reference/>
            <Application_Reference>shipment-binder-component</Application_Reference>
           <GCSS_Reference/>
            <Kind>Q</Kind>
            <Date_received/>
            <Time_Received/>
            <Reply_requested>Y</Reply_requested>
            <Message_Type_Code/>
            <Test_Flag/>
            <EDI_Receiver/>
            <EDI_AppRefNum/>
            <Version>34.0</Version>
            <Sent_By_Username/>
            <Sent_By_Name/>
            <Sent_By_Email/>
            <RaiseNotification/>
            <Sent_By_U-Adm_Team_Id/>
            <TAGQ100>
              <Size_of_reply_buffer/>
              <Max_number_of_bytes_in_result_set/>
              <Priority/>
              <Reply_Type>T</Reply_Type>
              <Include_Related_Shipments/>
              <Include_Transport_Document_on_Import_Shipment/>
            </TAGQ100>
            <TAGQ200>
              <Shipment_Status/>
              <Operator>3</Operator>
              <Not_Operator/>
              <Business_Unit/>
              <TAGQ232>
                <Reference_Type>5</Reference_Type>
                <Property_Type/>
                <Reference_Value>911318503</Reference_Value>
                <Property_Value/>
              </TAGQ232>
            </TAGQ200>
            <TAGQ300>
              <Tag_ids>TAG0100,TAG0110,TAG2100,TAG2120,TAG21G0,TAG21G1,TAG21K0,TAG2200,TAG2500,TAG2510</Tag_ids>
            </TAGQ300>
          </TAG0000>
        </GCSSMessage>
      </soap:Body>
    </soap:Envelope>
